# 1.task
# Создайте список из 6 чисел и отсортируйте его в порядке убывания с использованием метода sort.
numbers = [5, 2, 9, 1, 7, 6]
numbers.sort(reverse=True)
print(numbers)

# 2.task
# Создайте список из 5 чисел и найдите индекс максимального элемента, используя функции max и index.
numbers = [5, 8, 2, 10, 3]
max_value = max(numbers)
index = numbers.index(max_value)
print(index)

# 3.task
# Напишите программу, которая создает список из 5 чисел и удаляет последний элемент, используя оператор del.
numbers = [12, 7, 9, 3, 15]
del numbers[-1]
print(numbers)

# 4.task

# 5.task

# 6.task

# 7.task

# 8.task

# 9.task

# 10.task

# 11.task

# 12.task

# 13.task

# 14.task

# 15.task
